# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [19]:
import pandas as pd 
import numpy as np
import csv

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [20]:
url1 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv'
url2 = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv'
cars1 = pd.read_csv(url1,sep=',')
cars2 = pd.read_csv(url2,sep=',')

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [21]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

In [22]:
cars1=cars1.drop(columns=['Unnamed: 11','Unnamed: 12','Unnamed: 9','Unnamed: 10','Unnamed: 13'])

In [23]:
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [24]:
print(cars1.shape)

print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [25]:
cars = cars1.append(cars2)
print(cars.head())
cars.shape

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite
3       1              amc rebel sst
4       1                ford torino

(398, 9)

In [26]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [27]:

owners = np.random.randint(15000,73000,cars.shape[0])
owners

array([49240, 63928, 64322, 19190, 27326, 72265, 59336, 40288, 72546,
       68176, 24204, 18057, 27062, 59676, 44884, 23336, 46413, 69522,
       32826, 23825, 62369, 57509, 23557, 52529, 48349, 52046, 24017,
       68095, 55455, 27677, 69852, 48696, 68509, 23740, 26401, 45958,
       54451, 15877, 34854, 62467, 22884, 53330, 32190, 18836, 49615,
       59935, 19902, 50471, 26968, 69490, 70187, 34479, 70258, 18439,
       37626, 50334, 63016, 32978, 37890, 71968, 30299, 30726, 50345,
       55179, 53673, 16767, 70857, 20282, 38242, 58473, 63445, 56794,
       24181, 27590, 68824, 71448, 65985, 49658, 34066, 37394, 16076,
       15008, 40725, 60264, 57812, 39125, 69900, 40019, 19790, 32729,
       41933, 16430, 19634, 18555, 16065, 54760, 44400, 47118, 60753,
       63015, 38032, 18741, 70471, 36030, 27304, 52816, 49833, 51003,
       68606, 45891, 47062, 63865, 33514, 67294, 32616, 29613, 34484,
       23565, 23441, 21962, 65301, 42410, 65927, 27751, 36143, 27340,
       21561, 37180, 51934, 50227, 33253, 68668, 56971, 70748, 71346,
       50445, 31177, 30002, 45277, 70887, 61969, 31589, 25166, 61846,
       49713, 30245, 67359, 32943, 45353, 71699, 70269, 18735, 58235,
       71693, 50231, 67971, 59744, 51959, 30547, 22057, 51776, 57711,
       72455, 59395, 20124, 25625, 63643, 46365, 20326, 30482, 44774,
       70965, 32932, 28117, 62723, 41332, 41054, 41858, 72038, 37580,
       67573, 34106, 37488, 28604, 23153, 63110, 63678, 55184, 65320,
       50327, 15286, 55844, 50379, 53701, 43439, 46377, 27550, 26405,
       30155, 42079, 45111, 71505, 61547, 59237, 17340, 49147, 24212,
       50277, 59911, 48784, 44369, 16960, 44299, 29038, 36110, 68435,
       18932, 51568, 21517, 28234, 29961, 72428, 28094, 35560, 61113,
       46500, 16959, 62551, 67473, 51300, 25049, 21711, 44226, 52837,
       66447, 30843, 31014, 66984, 72764, 72473, 16015, 57053, 30883,
       17999, 16465, 60054, 38935, 48872, 24704, 50968, 63295, 41382,
       45519, 54577, 40491, 55486, 69664, 18816, 43300, 70134, 21417,
       20414, 67132, 30580, 20833, 57200, 47200, 20314, 45012, 51780,
       57161, 21395, 63366, 28808, 39995, 43267, 51516, 67205, 55610,
       30560, 39215, 60958, 58534, 67055, 26910, 22144, 20293, 25751,
       44156, 42773, 53939, 72905, 45307, 45529, 19277, 54705, 46733,
       33397, 66030, 25908, 58610, 67471, 43481, 55034, 23553, 41839,
       51975, 27641, 26989, 27043, 40310, 61198, 23716, 61435, 62383,
       45179, 51499, 61389, 38829, 49876, 28404, 41806, 72317, 41539,
       71207, 17843, 25358, 32595, 40258, 47808, 67104, 40801, 42052,
       34456, 23885, 62986, 59210, 60354, 25167, 34224, 34470, 20839,
       38335, 19812, 42612, 26405, 41691, 70371, 30951, 18309, 25471,
       36238, 20253, 33887, 45660, 71750, 58621, 59629, 59646, 71728,
       17612, 67679, 38362, 19826, 49690, 36330, 38609, 25426, 21373,
       60180, 25746, 34934, 59413, 30448, 34355, 50532, 57209, 54097,
       61958, 39581, 68281, 34166, 19845, 37324, 38420, 63787, 31313,
       23080, 21500, 71814, 44118, 54421, 56313, 51982, 43435, 61188,
       19752, 67597])

### Step 8. Add the column owners to cars

In [28]:
cars['owners'] = owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,49240
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,63928
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,64322
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,19190
4,17.0,8,302,140,3449,10.5,70,1,ford torino,27326